Revit 2027 API
RoutingConditions.GetNumberOfConditions Method
 Gets the number of included routing conditions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetNumberOfConditions()
Public Function GetNumberOfConditions As Integer
public:
int GetNumberOfConditions()
member GetNumberOfConditions : unit -> int
Return Value
Int32
See Also
Reference
RoutingConditions Class
Autodesk.Revit.DB Namespace